test/Lagrangian/injections/0/Lagrangian/kinematicParticle/d
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       LagrangianScalarField;
    location    "0/Lagrangian/kinematicParticle";
    object      d;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [length];

internalField   uniform 1e-3;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            calculated;
    }
}

sources
{
    pointInjection1
    {
        type            distribution;
        distribution
        {
            type            RosinRammler;
            Q               0;
            min             0.1 [mm];
            max             1.5 [mm];
            d               1.4 [mm];
            n               2 [];
        }
    }

    pointInjection2
    {
        $pointInjection1;
    }

    pointInjection3
    {
        $pointInjection1;
    }
}


// ************************************************************************* //
