test/Lagrangian/injections/0/Lagrangian/particle/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       LagrangianScalarField;
    location    "0/Lagrangian/particle";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [density];

internalField   uniform 1000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            calculated;
    }
}

sources
{
    volumeInjection
    {
        type            uniformFixedValue;
        uniformValue    1000;
    }

    patchInjection
    {
        type            uniformFixedValue;
        uniformValue    1001;
    }

    diskInjection
    {
        type            uniformFixedValue;
        uniformValue    1003;
    }
}


// ************************************************************************* //
